Dlubal.RFEM5.SurfaceLoad
Surface load parameters.

Dlubal.RFEM5.SurfaceLoad.No
Number

Dlubal.RFEM5.SurfaceLoad.ID
Identifier

Dlubal.RFEM5.SurfaceLoad.Comment
Comment

Dlubal.RFEM5.SurfaceLoad.Tag
Tag

Dlubal.RFEM5.SurfaceLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.SurfaceLoad.SurfaceList
List of surfaces on which is the load defined.

Dlubal.RFEM5.SurfaceLoad.Type
Type of surface load

Dlubal.RFEM5.SurfaceLoad.Distribution
Distribution of surface load

Dlubal.RFEM5.SurfaceLoad.Direction
Direction of surface load

Dlubal.RFEM5.SurfaceLoad.Node1No
Load at the first node

Dlubal.RFEM5.SurfaceLoad.Magnitude1
Magnitude at the first node

Dlubal.RFEM5.SurfaceLoad.Node2No
Load at the second node

Dlubal.RFEM5.SurfaceLoad.Magnitude2
Magnitude at the second node

Dlubal.RFEM5.SurfaceLoad.Node3No
Load at the third node

Dlubal.RFEM5.SurfaceLoad.Magnitude3
Magnitude at the third node

Dlubal.RFEM5.SurfaceLoad.Magnitude4
Magnitude at the first node

Dlubal.RFEM5.SurfaceLoad.Magnitude5
Magnitude at the second node

Dlubal.RFEM5.SurfaceLoad.Magnitude6
Magnitude at the third node

Dlubal.RFEM5.SurfaceLoad.LoadAxis
Axis of rotary motion or radial distribution